{
	"missing.required.envs": "Required environment variable is missing.  Please set %s as described in the README.",
	"no.configured.tag.generators": "Unable to initialize Object Storage Search Engine, because no configured tag generators.",
	"unable.to.load.generators": "Error while loading tag generators.",
	"nlc.training.started": "NLC training for Object Storage started successfully.",
	"nlc.training.not.started": "NLC training for Object Storage has not started.",
	"classifier.already.training": "NLC used for Object Storage is already training.  Please allow training to complete.",
	"missing.search.string": "Unable to perform search, because no search string was provided.",
	"search.completed.successfully": "Search completed successfully.",
	"unable.to.search.still.training": "Unable to perform search.  Indexing is still training NLC.  Please allow more time for indexing to complete.",
	"unable.to.search.index.not.started": "Unable to perform search because Object Storage has not been index.  Please run scan and index commands.",
	"engine.is.busy": "Unable to perform the requested action, because the search engine is currently busy.",
	"no.index.while.scanning": "Unable to start indexing while scan is running.",
	"no.index.while.indexing": "Unable to start indexing while another index operation is running.",
	"no.scan.while.scanning": "Unable to start scan while another scan is running.",
	"no.scan.while.indexing": "Unable to start scan while search engine is indexing.",
	"scan.completed.changes.yes": "Object Storage scan complete.  Changes since last indexing: %s added, %s removed.  Please run index command to process the changes.",
	"scan.completed.changes.no": "Object Storage scan complete.  There have been no changes since last indexing.  Wait a while and rescan for new changes.",
	"scan.before.index": "Unable to index because no scan has been performed.  Please run scan before attempting to index.",
	"no.changes.to.index": "There are no changes to index.  Wait a while, rescan and index if there are new changes."
}